{
  "additional_special_tokens": [
    "<|sep|>",
    "<|reserved_5|>",
    "<|reserved_6|>",
    "<|reserved_7|>",
    "<|reserved_8|>",
    "<|reserved_9|>",
    "<|reserved_10|>",
    "<|reserved_11|>",
    "<|reserved_12|>",
    "<|reserved_13|>",
    "<|reserved_14|>",
    "<|reserved_15|>",
    "<|im_start|>",
    "<|im_end|>",
    "<|system|>",
    "<|user|>",
    "<|assistant|>",
    "<|tool|>",
    "<|tool_call|>",
    "<|tool_result|>",
    "<|reserved_24|>",
    "<|reserved_25|>",
    "<|reserved_26|>",
    "<|reserved_27|>",
    "<|reserved_28|>",
    "<|reserved_29|>",
    "<|reserved_30|>",
    "<|reserved_31|>",
    "<|img_start|>",
    "<|img_end|>",
    "<|img_pad|>",
    "<|img_row_sep|>",
    "<|reserved_36|>",
    "<|reserved_37|>",
    "<|reserved_38|>",
    "<|reserved_39|>",
    "<|reserved_40|>",
    "<|reserved_41|>",
    "<|reserved_42|>",
    "<|reserved_43|>",
    "<|reserved_44|>",
    "<|reserved_45|>",
    "<|reserved_46|>",
    "<|reserved_47|>",
    "<|reserved_48|>",
    "<|reserved_49|>",
    "<|reserved_50|>",
    "<|reserved_51|>",
    "<|reserved_52|>",
    "<|reserved_53|>",
    "<|reserved_54|>",
    "<|reserved_55|>",
    "<|reserved_56|>",
    "<|reserved_57|>",
    "<|reserved_58|>",
    "<|reserved_59|>",
    "<|reserved_60|>",
    "<|reserved_61|>",
    "<|reserved_62|>",
    "<|reserved_63|>",
    "<|reserved_64|>",
    "<|reserved_65|>",
    "<|reserved_66|>",
    "<|reserved_67|>",
    "<|reserved_68|>",
    "<|reserved_69|>",
    "<|reserved_70|>",
    "<|reserved_71|>",
    "<|reserved_72|>",
    "<|reserved_73|>",
    "<|reserved_74|>",
    "<|reserved_75|>",
    "<|reserved_76|>",
    "<|reserved_77|>",
    "<|reserved_78|>",
    "<|reserved_79|>",
    "<|reserved_80|>",
    "<|reserved_81|>",
    "<|reserved_82|>",
    "<|reserved_83|>",
    "<|reserved_84|>",
    "<|reserved_85|>",
    "<|reserved_86|>",
    "<|reserved_87|>",
    "<|reserved_88|>",
    "<|reserved_89|>",
    "<|reserved_90|>",
    "<|reserved_91|>",
    "<|reserved_92|>",
    "<|reserved_93|>",
    "<|reserved_94|>",
    "<|reserved_95|>",
    "<|reserved_96|>",
    "<|reserved_97|>",
    "<|reserved_98|>",
    "<|reserved_99|>",
    "<|reserved_100|>",
    "<|reserved_101|>",
    "<|reserved_102|>",
    "<|reserved_103|>",
    "<|reserved_104|>",
    "<|reserved_105|>",
    "<|reserved_106|>",
    "<|reserved_107|>",
    "<|reserved_108|>",
    "<|reserved_109|>",
    "<|reserved_110|>",
    "<|reserved_111|>",
    "<|reserved_112|>",
    "<|reserved_113|>",
    "<|reserved_114|>",
    "<|reserved_115|>",
    "<|reserved_116|>",
    "<|reserved_117|>",
    "<|reserved_118|>",
    "<|reserved_119|>",
    "<|reserved_120|>",
    "<|reserved_121|>",
    "<|reserved_122|>",
    "<|reserved_123|>",
    "<|reserved_124|>",
    "<|reserved_125|>",
    "<|reserved_126|>",
    "<|reserved_127|>",
    "<|reserved_128|>",
    "<|reserved_129|>",
    "<|reserved_130|>",
    "<|reserved_131|>",
    "<|reserved_132|>",
    "<|reserved_133|>",
    "<|reserved_134|>",
    "<|reserved_135|>",
    "<|reserved_136|>",
    "<|reserved_137|>",
    "<|reserved_138|>",
    "<|reserved_139|>",
    "<|reserved_140|>",
    "<|reserved_141|>",
    "<|reserved_142|>",
    "<|reserved_143|>",
    "<|reserved_144|>",
    "<|reserved_145|>",
    "<|reserved_146|>",
    "<|reserved_147|>",
    "<|reserved_148|>",
    "<|reserved_149|>",
    "<|reserved_150|>",
    "<|reserved_151|>",
    "<|reserved_152|>",
    "<|reserved_153|>",
    "<|reserved_154|>",
    "<|reserved_155|>",
    "<|reserved_156|>",
    "<|reserved_157|>",
    "<|reserved_158|>",
    "<|reserved_159|>",
    "<|reserved_160|>",
    "<|reserved_161|>",
    "<|reserved_162|>",
    "<|reserved_163|>",
    "<|reserved_164|>",
    "<|reserved_165|>",
    "<|reserved_166|>",
    "<|reserved_167|>",
    "<|reserved_168|>",
    "<|reserved_169|>",
    "<|reserved_170|>",
    "<|reserved_171|>",
    "<|reserved_172|>",
    "<|reserved_173|>",
    "<|reserved_174|>",
    "<|reserved_175|>",
    "<|reserved_176|>",
    "<|reserved_177|>",
    "<|reserved_178|>",
    "<|reserved_179|>",
    "<|reserved_180|>",
    "<|reserved_181|>",
    "<|reserved_182|>",
    "<|reserved_183|>",
    "<|reserved_184|>",
    "<|reserved_185|>",
    "<|reserved_186|>",
    "<|reserved_187|>",
    "<|reserved_188|>",
    "<|reserved_189|>",
    "<|reserved_190|>",
    "<|reserved_191|>",
    "<|reserved_192|>",
    "<|reserved_193|>",
    "<|reserved_194|>",
    "<|reserved_195|>",
    "<|reserved_196|>",
    "<|reserved_197|>",
    "<|reserved_198|>",
    "<|reserved_199|>",
    "<|reserved_200|>",
    "<|reserved_201|>",
    "<|reserved_202|>",
    "<|reserved_203|>",
    "<|reserved_204|>",
    "<|reserved_205|>",
    "<|reserved_206|>",
    "<|reserved_207|>",
    "<|reserved_208|>",
    "<|reserved_209|>",
    "<|reserved_210|>",
    "<|reserved_211|>",
    "<|reserved_212|>",
    "<|reserved_213|>",
    "<|reserved_214|>",
    "<|reserved_215|>",
    "<|reserved_216|>",
    "<|reserved_217|>",
    "<|reserved_218|>",
    "<|reserved_219|>",
    "<|reserved_220|>",
    "<|reserved_221|>",
    "<|reserved_222|>",
    "<|reserved_223|>",
    "<|reserved_224|>",
    "<|reserved_225|>",
    "<|reserved_226|>",
    "<|reserved_227|>",
    "<|reserved_228|>",
    "<|reserved_229|>",
    "<|reserved_230|>",
    "<|reserved_231|>",
    "<|reserved_232|>",
    "<|reserved_233|>",
    "<|reserved_234|>",
    "<|reserved_235|>",
    "<|reserved_236|>",
    "<|reserved_237|>",
    "<|reserved_238|>",
    "<|reserved_239|>",
    "<|reserved_240|>",
    "<|reserved_241|>",
    "<|reserved_242|>",
    "<|reserved_243|>",
    "<|reserved_244|>",
    "<|reserved_245|>",
    "<|reserved_246|>",
    "<|reserved_247|>",
    "<|reserved_248|>",
    "<|reserved_249|>",
    "<|reserved_250|>",
    "<|reserved_251|>",
    "<|reserved_252|>",
    "<|reserved_253|>",
    "<|reserved_254|>",
    "<|reserved_255|>"
  ],
  "bos_token": "<|bos|>",
  "eos_token": "<|eos|>",
  "pad_token": "<|pad|>",
  "special_token_ids": {
    "<|assistant|>": 16148,
    "<|bos|>": 16130,
    "<|eos|>": 16131,
    "<|im_end|>": 16145,
    "<|im_start|>": 16144,
    "<|img_end|>": 16161,
    "<|img_pad|>": 16162,
    "<|img_row_sep|>": 16163,
    "<|img_start|>": 16160,
    "<|pad|>": 16128,
    "<|reserved_100|>": 16228,
    "<|reserved_101|>": 16229,
    "<|reserved_102|>": 16230,
    "<|reserved_103|>": 16231,
    "<|reserved_104|>": 16232,
    "<|reserved_105|>": 16233,
    "<|reserved_106|>": 16234,
    "<|reserved_107|>": 16235,
    "<|reserved_108|>": 16236,
    "<|reserved_109|>": 16237,
    "<|reserved_10|>": 16138,
    "<|reserved_110|>": 16238,
    "<|reserved_111|>": 16239,
    "<|reserved_112|>": 16240,
    "<|reserved_113|>": 16241,
    "<|reserved_114|>": 16242,
    "<|reserved_115|>": 16243,
    "<|reserved_116|>": 16244,
    "<|reserved_117|>": 16245,
    "<|reserved_118|>": 16246,
    "<|reserved_119|>": 16247,
    "<|reserved_11|>": 16139,
    "<|reserved_120|>": 16248,
    "<|reserved_121|>": 16249,
    "<|reserved_122|>": 16250,
    "<|reserved_123|>": 16251,
    "<|reserved_124|>": 16252,
    "<|reserved_125|>": 16253,
    "<|reserved_126|>": 16254,
    "<|reserved_127|>": 16255,
    "<|reserved_128|>": 16256,
    "<|reserved_129|>": 16257,
    "<|reserved_12|>": 16140,
    "<|reserved_130|>": 16258,
    "<|reserved_131|>": 16259,
    "<|reserved_132|>": 16260,
    "<|reserved_133|>": 16261,
    "<|reserved_134|>": 16262,
    "<|reserved_135|>": 16263,
    "<|reserved_136|>": 16264,
    "<|reserved_137|>": 16265,
    "<|reserved_138|>": 16266,
    "<|reserved_139|>": 16267,
    "<|reserved_13|>": 16141,
    "<|reserved_140|>": 16268,
    "<|reserved_141|>": 16269,
    "<|reserved_142|>": 16270,
    "<|reserved_143|>": 16271,
    "<|reserved_144|>": 16272,
    "<|reserved_145|>": 16273,
    "<|reserved_146|>": 16274,
    "<|reserved_147|>": 16275,
    "<|reserved_148|>": 16276,
    "<|reserved_149|>": 16277,
    "<|reserved_14|>": 16142,
    "<|reserved_150|>": 16278,
    "<|reserved_151|>": 16279,
    "<|reserved_152|>": 16280,
    "<|reserved_153|>": 16281,
    "<|reserved_154|>": 16282,
    "<|reserved_155|>": 16283,
    "<|reserved_156|>": 16284,
    "<|reserved_157|>": 16285,
    "<|reserved_158|>": 16286,
    "<|reserved_159|>": 16287,
    "<|reserved_15|>": 16143,
    "<|reserved_160|>": 16288,
    "<|reserved_161|>": 16289,
    "<|reserved_162|>": 16290,
    "<|reserved_163|>": 16291,
    "<|reserved_164|>": 16292,
    "<|reserved_165|>": 16293,
    "<|reserved_166|>": 16294,
    "<|reserved_167|>": 16295,
    "<|reserved_168|>": 16296,
    "<|reserved_169|>": 16297,
    "<|reserved_170|>": 16298,
    "<|reserved_171|>": 16299,
    "<|reserved_172|>": 16300,
    "<|reserved_173|>": 16301,
    "<|reserved_174|>": 16302,
    "<|reserved_175|>": 16303,
    "<|reserved_176|>": 16304,
    "<|reserved_177|>": 16305,
    "<|reserved_178|>": 16306,
    "<|reserved_179|>": 16307,
    "<|reserved_180|>": 16308,
    "<|reserved_181|>": 16309,
    "<|reserved_182|>": 16310,
    "<|reserved_183|>": 16311,
    "<|reserved_184|>": 16312,
    "<|reserved_185|>": 16313,
    "<|reserved_186|>": 16314,
    "<|reserved_187|>": 16315,
    "<|reserved_188|>": 16316,
    "<|reserved_189|>": 16317,
    "<|reserved_190|>": 16318,
    "<|reserved_191|>": 16319,
    "<|reserved_192|>": 16320,
    "<|reserved_193|>": 16321,
    "<|reserved_194|>": 16322,
    "<|reserved_195|>": 16323,
    "<|reserved_196|>": 16324,
    "<|reserved_197|>": 16325,
    "<|reserved_198|>": 16326,
    "<|reserved_199|>": 16327,
    "<|reserved_200|>": 16328,
    "<|reserved_201|>": 16329,
    "<|reserved_202|>": 16330,
    "<|reserved_203|>": 16331,
    "<|reserved_204|>": 16332,
    "<|reserved_205|>": 16333,
    "<|reserved_206|>": 16334,
    "<|reserved_207|>": 16335,
    "<|reserved_208|>": 16336,
    "<|reserved_209|>": 16337,
    "<|reserved_210|>": 16338,
    "<|reserved_211|>": 16339,
    "<|reserved_212|>": 16340,
    "<|reserved_213|>": 16341,
    "<|reserved_214|>": 16342,
    "<|reserved_215|>": 16343,
    "<|reserved_216|>": 16344,
    "<|reserved_217|>": 16345,
    "<|reserved_218|>": 16346,
    "<|reserved_219|>": 16347,
    "<|reserved_220|>": 16348,
    "<|reserved_221|>": 16349,
    "<|reserved_222|>": 16350,
    "<|reserved_223|>": 16351,
    "<|reserved_224|>": 16352,
    "<|reserved_225|>": 16353,
    "<|reserved_226|>": 16354,
    "<|reserved_227|>": 16355,
    "<|reserved_228|>": 16356,
    "<|reserved_229|>": 16357,
    "<|reserved_230|>": 16358,
    "<|reserved_231|>": 16359,
    "<|reserved_232|>": 16360,
    "<|reserved_233|>": 16361,
    "<|reserved_234|>": 16362,
    "<|reserved_235|>": 16363,
    "<|reserved_236|>": 16364,
    "<|reserved_237|>": 16365,
    "<|reserved_238|>": 16366,
    "<|reserved_239|>": 16367,
    "<|reserved_240|>": 16368,
    "<|reserved_241|>": 16369,
    "<|reserved_242|>": 16370,
    "<|reserved_243|>": 16371,
    "<|reserved_244|>": 16372,
    "<|reserved_245|>": 16373,
    "<|reserved_246|>": 16374,
    "<|reserved_247|>": 16375,
    "<|reserved_248|>": 16376,
    "<|reserved_249|>": 16377,
    "<|reserved_24|>": 16152,
    "<|reserved_250|>": 16378,
    "<|reserved_251|>": 16379,
    "<|reserved_252|>": 16380,
    "<|reserved_253|>": 16381,
    "<|reserved_254|>": 16382,
    "<|reserved_255|>": 16383,
    "<|reserved_25|>": 16153,
    "<|reserved_26|>": 16154,
    "<|reserved_27|>": 16155,
    "<|reserved_28|>": 16156,
    "<|reserved_29|>": 16157,
    "<|reserved_30|>": 16158,
    "<|reserved_31|>": 16159,
    "<|reserved_36|>": 16164,
    "<|reserved_37|>": 16165,
    "<|reserved_38|>": 16166,
    "<|reserved_39|>": 16167,
    "<|reserved_40|>": 16168,
    "<|reserved_41|>": 16169,
    "<|reserved_42|>": 16170,
    "<|reserved_43|>": 16171,
    "<|reserved_44|>": 16172,
    "<|reserved_45|>": 16173,
    "<|reserved_46|>": 16174,
    "<|reserved_47|>": 16175,
    "<|reserved_48|>": 16176,
    "<|reserved_49|>": 16177,
    "<|reserved_50|>": 16178,
    "<|reserved_51|>": 16179,
    "<|reserved_52|>": 16180,
    "<|reserved_53|>": 16181,
    "<|reserved_54|>": 16182,
    "<|reserved_55|>": 16183,
    "<|reserved_56|>": 16184,
    "<|reserved_57|>": 16185,
    "<|reserved_58|>": 16186,
    "<|reserved_59|>": 16187,
    "<|reserved_5|>": 16133,
    "<|reserved_60|>": 16188,
    "<|reserved_61|>": 16189,
    "<|reserved_62|>": 16190,
    "<|reserved_63|>": 16191,
    "<|reserved_64|>": 16192,
    "<|reserved_65|>": 16193,
    "<|reserved_66|>": 16194,
    "<|reserved_67|>": 16195,
    "<|reserved_68|>": 16196,
    "<|reserved_69|>": 16197,
    "<|reserved_6|>": 16134,
    "<|reserved_70|>": 16198,
    "<|reserved_71|>": 16199,
    "<|reserved_72|>": 16200,
    "<|reserved_73|>": 16201,
    "<|reserved_74|>": 16202,
    "<|reserved_75|>": 16203,
    "<|reserved_76|>": 16204,
    "<|reserved_77|>": 16205,
    "<|reserved_78|>": 16206,
    "<|reserved_79|>": 16207,
    "<|reserved_7|>": 16135,
    "<|reserved_80|>": 16208,
    "<|reserved_81|>": 16209,
    "<|reserved_82|>": 16210,
    "<|reserved_83|>": 16211,
    "<|reserved_84|>": 16212,
    "<|reserved_85|>": 16213,
    "<|reserved_86|>": 16214,
    "<|reserved_87|>": 16215,
    "<|reserved_88|>": 16216,
    "<|reserved_89|>": 16217,
    "<|reserved_8|>": 16136,
    "<|reserved_90|>": 16218,
    "<|reserved_91|>": 16219,
    "<|reserved_92|>": 16220,
    "<|reserved_93|>": 16221,
    "<|reserved_94|>": 16222,
    "<|reserved_95|>": 16223,
    "<|reserved_96|>": 16224,
    "<|reserved_97|>": 16225,
    "<|reserved_98|>": 16226,
    "<|reserved_99|>": 16227,
    "<|reserved_9|>": 16137,
    "<|sep|>": 16132,
    "<|system|>": 16146,
    "<|tool_call|>": 16150,
    "<|tool_result|>": 16151,
    "<|tool|>": 16149,
    "<|unk|>": 16129,
    "<|user|>": 16147
  },
  "unk_token": "<|unk|>"
}
